# AssemblyDifferenceNone Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyDifferenceNone Properties
AssemblyDifferenceNone Class See Also
---
The AssemblyDifferenceNone type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from AssemblyDifference.) |

# See Also
AssemblyDifferenceNone Class
Autodesk.Revit.DB Namespace